export const state = () => ({
  locations: [{
    groupName: 'Спорт',
    locations: ['Стадион', 'Фитнес зал', 'Ринг', 'Колизей', 'Ипподром']
  }, {
    groupName: 'Досуг',
    locations: ['Цирк', 'Каток', 'Библиотека', 'Музей', 'Театр']
  }, {
    groupName: 'Деятельность',
    locations: [
      'Нефтебаза',
      'Карьер',
      'Кузница',
      'Электростанция',
      'Лаборатория'
    ]
  }, {
    groupName: 'Закрытые',
    locations: [
      'Чил хата Серого',
      'СИЗО',
      'Казарма',
      'Гараж',
      'Канализация'
    ]
  }, {
    groupName: 'Открытые',
    locations: ['Кладбище', 'Свалка', 'Пастбище', 'Окоп', 'Лабиринт']
  }, {
    groupName: 'Транспорт',
    locations: [
      'Вагон',
      'Пиратский корабль',
      'Круизный лайнер',
      'Эскалатор',
      'Метро'
    ]
  }, {
    groupName: 'Другое',
    locations: [
      'Зомбиапокалипсис в городе',
      'Логово ведьмы',
      'Поле средневековой битвы',
      'Тронный зал',
      'Пограничный КПП'
    ]
  }],
})

export const getters = {
  getLocations: (state) => {
    return state.locations
  },
}
